{
  "add_cross_attention": false,
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-CASE_NUMBER",
    "2": "I-CASE_NUMBER",
    "3": "B-COURT",
    "4": "I-COURT",
    "5": "B-JUDGMENT_DATE",
    "6": "I-JUDGMENT_DATE",
    "7": "B-CASE_TYPE",
    "8": "I-CASE_TYPE",
    "9": "B-DEFENDANT",
    "10": "I-DEFENDANT",
    "11": "B-PLAINTIFF",
    "12": "I-PLAINTIFF",
    "13": "B-VICTIM",
    "14": "I-VICTIM",
    "15": "B-RELATED_PARTY",
    "16": "I-RELATED_PARTY",
    "17": "B-LAW_NAME",
    "18": "I-LAW_NAME",
    "19": "B-ARTICLE",
    "20": "I-ARTICLE",
    "21": "B-CLAUSE",
    "22": "I-CLAUSE",
    "23": "B-POINT",
    "24": "I-POINT",
    "25": "B-LEGAL_BASIS",
    "26": "I-LEGAL_BASIS",
    "27": "B-CRIME",
    "28": "I-CRIME",
    "29": "B-VIOLATION_ACT",
    "30": "I-VIOLATION_ACT",
    "31": "B-PENALTY",
    "32": "I-PENALTY",
    "33": "B-MONEY_AMOUNT",
    "34": "I-MONEY_AMOUNT",
    "35": "B-COMPENSATION",
    "36": "I-COMPENSATION",
    "37": "B-COURT_FEE",
    "38": "I-COURT_FEE",
    "39": "B-DECISION",
    "40": "I-DECISION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-ARTICLE": 19,
    "B-CASE_NUMBER": 1,
    "B-CASE_TYPE": 7,
    "B-CLAUSE": 21,
    "B-COMPENSATION": 35,
    "B-COURT": 3,
    "B-COURT_FEE": 37,
    "B-CRIME": 27,
    "B-DECISION": 39,
    "B-DEFENDANT": 9,
    "B-JUDGMENT_DATE": 5,
    "B-LAW_NAME": 17,
    "B-LEGAL_BASIS": 25,
    "B-MONEY_AMOUNT": 33,
    "B-PENALTY": 31,
    "B-PLAINTIFF": 11,
    "B-POINT": 23,
    "B-RELATED_PARTY": 15,
    "B-VICTIM": 13,
    "B-VIOLATION_ACT": 29,
    "I-ARTICLE": 20,
    "I-CASE_NUMBER": 2,
    "I-CASE_TYPE": 8,
    "I-CLAUSE": 22,
    "I-COMPENSATION": 36,
    "I-COURT": 4,
    "I-COURT_FEE": 38,
    "I-CRIME": 28,
    "I-DECISION": 40,
    "I-DEFENDANT": 10,
    "I-JUDGMENT_DATE": 6,
    "I-LAW_NAME": 18,
    "I-LEGAL_BASIS": 26,
    "I-MONEY_AMOUNT": 34,
    "I-PENALTY": 32,
    "I-PLAINTIFF": 12,
    "I-POINT": 24,
    "I-RELATED_PARTY": 16,
    "I-VICTIM": 14,
    "I-VIOLATION_ACT": 30,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.8.1",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 250002
}
